# Дана строка. Преобразовать в ней все строчные буквы(как латинские, так и русские) в прописные.

s = input("Введите строку: ")

print(f"Результат: {s.upper()}")
