import sqlite3

def insert_initial_data():
    initial_workers = [
        ("Иванов", "Иван", "Иванович", 25, "М", "Программист", 3),
        ("Петрова", "Анна", "Сергеевна", 32, "Ж", "Дизайнер", 7),
        ("Сидоров", "Олег", "Петрович", 45, "М", "Инженер", 20),
        ("Кузнецова", "Елена", "Дмитриевна", 21, "Ж", "Программист", 1),
        ("Смирнов", "Алексей", "Николаевич", 29, "М", "Маркетолог", 5),
        ("Попова", "Мария", "Андреевна", 38, "Ж", "Бухгалтер", 12),
        ("Васильев", "Дмитрий", "Александрович", 50, "М", "Инженер", 26),
        ("Соколова", "Ольга", "Игоревна", 27, "Ж", "Дизайнер", 4),
        ("Новиков", "Артем", "Владимирович", 33, "М", "Программист", 8),
        ("Морозова", "Татьяна", "Павловна", 41, "Ж", "Бухгалтер", 15)
    ]

    with sqlite3.connect("employment.db") as conn:
        cursor = conn.cursor()
        cursor.executemany("""
            INSERT INTO workers (last_name, first_name, middle_name, age, gender, profession, experience)
            VALUES (?, ?, ?, ?, ?, ?, ?)
        """, initial_workers)
        conn.commit()
